# Markdown 
## Overview
**Markdown** is a lightweight markup language with plain text formatting syntax.
### Strong and Emphasize
**Honesty is the best policy** or __Save for a rainy day__
*Like father, like son* or _So far so good_
#### Blockquotes
> Better safe than sorry

# Python Basic

In [1]:
# integer
x = 100
y = 2
x = x + 1
print(x)
type(y)

101

int

In [2]:
# float
y = 5.0 
print(y)
print(type(y))

5.0
<class 'float'>

In [ ]:
# math operations
x = 15
y = 4
print(x + y)
print(x - y)
print(x / y)
print(x * y)
print('---')
print(x // 2)
print(x % 2)
​
print(21 // 5)
print(27 % 3)
​
x = 5
x % 2 == 1

In [7]:
# boolean
b = True
False
not True
not False
print(not b)
print(type(b))

False
<class 'bool'>

In [4]:
# string
s1 = 'hello'
s2 = "world"
print(type(s1))
message = s1 + ' ' + s2
print(message)

<class 'str'>
hello world

In [ ]:
print('2 < 3 :', 2 < 3)
print('10 > 20 :', 10 > 20)
print('4 == 5 :', 4 == 5)
print('4 != 5 :', 4 != 5)

x = 3
min = 1
max = 5
print(x, 'is not between', min, 'and', max, ':', not ((x >= min) and (x <= max))) 
# How about not between?

In [ ]:
# list
li = []
li.append(1)    # li is now [1]
li.append(2)    # li is now [1, 2]
li.append(3)    # li is now [1, 2, 3]
li.append(4)    # li is now [1, 2, 3, 4]
# Remove from the end with pop
li.pop()        # => 4 and li is now [1, 2, 3]
# Let's put it back
li.append(4)    # li is now [1, 2, 3, 4] again.
li

In [ ]:
# tuple is like list but immutable
tup = (1, 2, 3)
print(tup[0])

In [ ]:
s = {"a","b","c"}
type(s)

# IF

In [8]:
import numpy as np

x = np.random.randint(10)
# x = 3
answer = ''
if x > 5: 
    answer = "Greater than 5"
elif x < 3:
    answer = "Less than 3"
else:
    if x == 3:
        answer = "equal 3"
    elif x == 4:
        answer = "equal 4"
    else:
        answer = "equal 5"
print(x)
print(answer)

# Notice the code indentation

8
Greater than 5

# for LOOP

In [9]:
# iterate a list
a = list(range(1,10))
for i in a:
  print("processing {i}")

processing {i}
processing {i}
processing {i}
processing {i}
processing {i}
processing {i}
processing {i}
processing {i}
processing {i}

# while LOOP

In [ ]:
counter = 0
while (counter < 12):
    print(counter)
    counter = counter + 2

# Function

In [13]:
def printme(str):
   "This prints a passed string into this function"
   print(str)
   return

printme("I'm first call to user defined function!")
printme("Again second call to the same function")

I'm first call to user defined function!
Again second call to the same function

In [ ]:
def multiple_add(*args):
  return sum(args)

multiple_add(1,2,3,4,5,7,8,9,1,2,3)

In [ ]:
def min_max(arr):
  min_value = arr[0]
  max_value = arr[0] 
  for i in arr:
    if i < min_value:
      min_value = i
    if i > max_value:
      max_value = i
  return (min_value, max_value)

mi, ma = min_max([1,2,3,4])
print(mi)
print(ma)

 # LAB

## Find the biggest and smallest number

In [4]:
# Write a function to find smallest and biggest number out of given 3 numbers.
# Use if-statement only to solve this.
# Example: a=4, b=18, c=2 -> return 2

import numpy as np

a = np.random.randint(100)
b = np.random.randint(100)
c = np.random.randint(100)

print(a, b, c)

def smallest(a, b, c):
    if (a > b) and (a > c):
        largest_num = a
    elif (b > a) and (b > c):
        largest_num = b
    else:
        largest_num = c
    #print("The largest of the 3 numbers is : ", largest_num)
    return largest_num

def largest(a, b, c):
    if (a < b) and (a < c):
        smallest_num = a
    elif (b < a) and (b < c):
        smallest_num = b
    else:
        smallest_num = c
    #print("The smallest of the 3 numbers is : ", smallest_num)
    return smallest_num


print('The smallest of the 3 numbers is: ', smallest(a, b, c))
print('The smallest of the 3 numbers is: ', largest(a, b, c))

4 62 97
The smallest of the 3 numbers is:  97
The smallest of the 3 numbers is:  4

## Sum of numbers between a and b

In [11]:
# Given two integers a and b (a ≤ b). Print sum of all numbers from A to B inclusively.
# Use a for-loop to solve this.
# Example a = 1, b = 10 -> 1+2+3+4+5+6+7+8+9+10 = 55

a = np.random.randint(10)
b = a + np.random.randint(10)

s = 0

# Your code here
for x in range(a,b+1):
    #print(x)
    s+=x;

print('The value of the a and b numbers is: ',a, b)
print('The sum of all numbers from a to b inclusively is: ', s)

The value of the a and b numbers is:  1 10
The sum of all numbers from a to b inclusively is:  55

## List all odd numbers

In [21]:
# For a given interger n, write a function that print all odd numbers that are less than or equal n.
# Use a while-loop to solve this.
# Example n=5 -> 1 3 5

n = np.random.randint(100)

print('n = ', n)

# Your code here
for num in range(n+ 1): 
    # checking condition 
    if num % 2 != 0: 
        print(num, end= " ")

n =  81
1 3 5 7 9 11 13 15 17 19 21 23 25 27 29 31 33 35 37 39 41 43 45 47 49 51 53 55 57 59 61 63 65 67 69 71 73 75 77 79 81

## Advance Python

## No.01
Write a function that rotates a list by k elements. For example, [1, 2, 3, 4, 5, 6] rotated by two becomes [3, 4, 5, 6, 1, 2]. Try solving this without creating a copy of the list. How many swap or move operations do you need? Example:

input:

[1, 2, 3, 4, 5, 6, 7, 8]
k = 3
output:

[4, 5, 6, 7, 8, 1, 2, 3]

-------------------------------------------------------------------------------------------------------------------------
### Solution
To rotate by one, store arr[0] in a temporary variable temp, move arr[1] to arr[0], arr[2] to arr[1] …and finally temp to arr[n-1]

Let us take the same example arr[] = [1, 2, 3, 4, 5, 6, 7], d = 2
Rotate arr[] by one 2 times
We get [2, 3, 4, 5, 6, 7, 1] after first rotation and [ 3, 4, 5, 6, 7, 1, 2] after second rotation.

In [19]:
def leftRotate(arr, d, n): 
    for i in range(d): 
        leftRotatebyOne(arr, n) 
# Function to left Rotate arr[] of size n by 1*/  
def leftRotatebyOne(arr, n): 
    temp = arr[0] 
    for i in range(n-1): 
        arr[i] = arr[i + 1] 
    arr[n-1] = temp 
          
  
# utility function to print an array */ 
def printArray(arr, size): 
    for i in range(size): 
        print ("% d"% arr[i], end =" ") 
  
   
# Driver program to test above functions */ 
arr = [1, 2, 3, 4, 5, 6, 7] 
leftRotate(arr, 5, 7) 
printArray(arr, 7)

 6  7  1  2  3  4  5

## No.02
Given a sorted list of integers, square the elements and give the output in sorted order.

For example, given [-9, -2, 0, 2, 3], return [0, 4, 4, 9, 81].

### Solution
Simple solution is to first convert each array elements into its square and than apply any “O(nlogn)” sorting algorithm to sort the array elements.

In [20]:
# Python program to Sort square 
# of the numbers of the array 
  
# Function to sort an square array 
def sortSquare(arr, n): 
  
    # First convert each array 
    # elements into its square 
    for i in range(n): 
        arr[i]= arr[i] * arr[i] 
    arr.sort() 
  
# Driver program to test above functions */ 
arr = [-6, -3, -1, 2, 4, 5] 
n = len(arr) 
  
print("Before sort") 
for i in range(n): 
    print(arr[i], end= " ") 
  
print("\n") 
  
sortSquare(arr, n) 
  
print("After sort") 
for i in range(n): 
    print(arr[i], end = " ")

Before sort
-6 -3 -1 2 4 5

After sort
1 4 9 16 25 36

## No.03
This problem was asked by Snapchat.

Given a list of possibly overlapping intervals, return a new list of intervals where all overlapping intervals have been merged.

The input list is not necessarily ordered in any way.

For example, given [(1, 3), (5, 8), (4, 10), (20, 25)], you should return [(1, 3), (4, 10), (20, 25)].

### Solution
1. Sort the intervals based on increasing order of 
    starting time.
2. Push the first interval on to a stack.
3. For each interval do the following
   a. If the current interval does not overlap with the stack 
       top, push it.
   b. If the current interval overlaps with stack top and ending
       time of current interval is more than that of stack top, 
       update stack top with the ending  time of current interval.
4. At the end stack contains the merged intervals.

In [25]:
temp_tuple = [[1,3], [5,8], [4,10], [20,25], [21,29],[-9,-1],[-18,-7]]

temp_tuple.sort(key=lambda interval: interval[0])
merged = [temp_tuple[0]]
for current in temp_tuple:
    previous = merged[-1]
    if current[0] <= previous[1]:
        previous[1] = max(previous[1], current[1])
    else:
        merged.append(current)
        
print(merged)

[[-18, -1], [1, 3], [4, 10], [20, 29]]

## No.04
Given a string, write a c function to check if it is palindrome or not. A string is said to be palindrome if reverse of the string is same as string. For example, “abba” is palindrome, but “abbc” is not palindrome.

### Solution
1) Find reverse of string
2) Check if reverse and original are same or not.

In [30]:
def reverse(s): 
    return s[::-1] 
  
def isPalindrome(s): 
    # Calling reverse function 
    rev = reverse(s) 
  
    # Checking if both string are equal or not 
    if (s == rev): 
        return True
    return False
  
  
# Driver code 
s = "abcdcba"
ans = isPalindrome(s) 
  
if ans == 1: 
    print("Yes") 
else: 
    print("No")

Yes

## No.05
You are given a string. The only operation allowed is to insert characters in the beginning of the string. How many minimum characters are needed to be inserted to make the string a palindrome string

Example: Input: ABC Output: 2 Input: AACECAAAA Output: 2

### Solution
Start checking the string each time if it is a palindrome and if not, then delete the last character and check again. When the string gets reduced to wither a palindrome or empty then the number of characters deleted from the end till now will be the answer as those characters could have been inserted at the beginning of the original string in the order which will will make the string a palindrome.

In [38]:
def ispalindrome(s): 
  
    l = len(s) 
      
    i = 0
    j = l - 1
    while i <= j: 
      
        if(s[i] != s[j]): 
            return False
        i += 1
        j -= 1
      
    return True
  
# Driver code 
if __name__ == "__main__": 
      
    s = "AACECAAAA" 
    cnt = 0
    flag = 0
      
    while(len(s) > 0): 
      
        # if string becomes palindrome then break 
        if(ispalindrome(s)): 
            flag = 1
            break
          
        else: 
            cnt += 1
          
            # erase the last element of the string 
            s = s[:-1] 
      
    # print the number of insertion at front 
    if(flag): 
        print(cnt)

2

# Basic SQL

In [ ]:
import wget
wget.download('https://ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com/devc/chinook.db')

In [43]:
import sqlite3
conn = sqlite3.connect('chinook.db')

In [44]:
import pandas as pd
data = pd.read_sql_query('SELECT * FROM albums;', conn)
data.head() 
# head(n) is a function that show n first rows of the data, by default n=5

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [54]:
data2 = pd.read_sql_query('SELECT * FROM employees LIMIT 10;', conn)
data2.head()

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [57]:
data4 = pd.read_sql_query('SELECT EmployeeId,LastName, FirstName  FROM employees LIMIT 10;', conn)
data4.head()

   EmployeeId LastName FirstName
0           1    Adams    Andrew
1           2  Edwards     Nancy
2           3  Peacock      Jane
3           4     Park  Margaret
4           5  Johnson     Steve

In [56]:
data3 = pd.read_sql_query('SELECT EmployeeId,Title FROM employees LIMIT 10;', conn)
data3.head()

   EmployeeId                Title
0           1      General Manager
1           2        Sales Manager
2           3  Sales Support Agent
3           4  Sales Support Agent
4           5  Sales Support Agent

In [58]:
pd.read_sql_query('SELECT * FROM invoices;',conn).head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86

In [59]:
# Find all $1 bill or lower
pd.read_sql_query('SELECT * FROM invoices WHERE Total < 1;',conn).head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,6,37,2009-01-19 00:00:00,Berger Straße 10,Frankfurt,None,Germany,60316,0.99
1,13,16,2009-02-19 00:00:00,1600 Amphitheatre Parkway,Mountain View,CA,USA,94043-1351,0.99
2,20,54,2009-03-22 00:00:00,110 Raeburn Pl,Edinburgh,None,United Kingdom,EH4 1HH,0.99
3,27,33,2009-04-22 00:00:00,5112 48 Street,Yellowknife,NT,Canada,X1A 1N6,0.99
4,34,12,2009-05-23 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,0.99

In [68]:
# Find all invoice of customers who are in the USA or Canada
pd.read_sql_query('SELECT * FROM invoices WHERE BillingCountry IN( "Canada","USA" ) ;',conn).head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
1,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86
2,13,16,2009-02-19 00:00:00,1600 Amphitheatre Parkway,Mountain View,CA,USA,94043-1351,0.99
3,14,17,2009-03-04 00:00:00,1 Microsoft Way,Redmond,WA,USA,98052-8300,1.98
4,15,19,2009-03-04 00:00:00,1 Infinite Loop,Cupertino,CA,USA,95014,1.98

In [82]:
# Find all invoice in 2011
pd.read_sql_query('SELECT * FROM invoices WHERE InvoiceDate LIKE "%2011%" ;',conn).head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,167,26,2011-01-02 00:00:00,2211 W Berry Street,Fort Worth,TX,USA,76110,0.99
1,168,27,2011-01-15 00:00:00,1033 N Park Ave,Tucson,AZ,USA,85719,1.98
2,169,29,2011-01-15 00:00:00,796 Dundas Street West,Toronto,ON,Canada,M6J 1V1,1.98
3,170,31,2011-01-16 00:00:00,194A Chain Lake Drive,Halifax,NS,Canada,B3S 1C5,3.96
4,171,35,2011-01-17 00:00:00,"Rua dos Campeões Europeus de Viena, 4350",Porto,None,Portugal,None,5.94

In [83]:
#Find a list of all countries where customers live in
pd.read_sql_query('SELECT * FROM invoices group by BillingCountry;',conn).head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,119,56,2010-06-12 00:00:00,307 Macacha Güemes,Buenos Aires,None,Argentina,1106,1.98
1,21,55,2009-04-04 00:00:00,421 Bourke Street,Sidney,NSW,Australia,2010,1.98
2,78,7,2009-12-08 00:00:00,"Rotenturmstraße 4, 1010 Innere Stadt",Vienne,None,Austria,1010,1.98
3,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
4,25,10,2009-04-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,8.91

In [87]:
# Find the top 5 cheapest bill
pd.read_sql_query('SELECT * FROM invoices WHERE Total = (SELECT MIN(Total) FROM invoices) LIMIT 5;',conn).head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,6,37,2009-01-19 00:00:00,Berger Straße 10,Frankfurt,None,Germany,60316,0.99
1,13,16,2009-02-19 00:00:00,1600 Amphitheatre Parkway,Mountain View,CA,USA,94043-1351,0.99
2,20,54,2009-03-22 00:00:00,110 Raeburn Pl,Edinburgh,None,United Kingdom,EH4 1HH,0.99
3,27,33,2009-04-22 00:00:00,5112 48 Street,Yellowknife,NT,Canada,X1A 1N6,0.99
4,34,12,2009-05-23 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,0.99

In [13]:
def problem2(list, k):
  a = [False] * 1000
  for i in list:
    a[i] = True
    for i in list:
        if a[k-i]:
          return True
  return False
print(problem2([10, 15, 3, 7], 20))

True